# Parameter Type Id Energy Analysis Zone Data Json Property

Source: https://www.revitapidocs.com/2026/6f413cd7-7e9d-21a2-8fd2-0c3a343c8036.htm

---

| Parameter Type Id Energy Analysis Zone Data Json Property |
| --- |

"Energy analysis zone data json"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId EnergyAnalysisZoneDataJson { get; }
```

```
Public Shared ReadOnly Property EnergyAnalysisZoneDataJson As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ EnergyAnalysisZoneDataJson {
	ForgeTypeId^ get ();
}
```

```
static member EnergyAnalysisZoneDataJson : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace